const menu = document.querySelector(".menu");
const menuIcon = document.querySelector(".menu .icon");
const changeButton = document.getElementById("change-player");
const currentName = document.querySelector(".current-name p");

if (localStorage.getItem("gamePlayer")){
    currentName.textContent = localStorage.getItem("gamePlayer")
} else{
    currentName.textContent = " غير معروف "
}


changeButton.addEventListener("click", (e) => {
    e.preventDefault();
    localStorage.removeItem("gamePlayer");
    history.replaceState(null, "", "../index.html");
    location.replace("../index.html");
})

menuIcon.addEventListener("click", () => {
    menu.classList.toggle("show");
})



/*


    {
        question: "طريق العز والنصر للمسلمين",
        questions: ["الدعاء فقط", "الدعاء مع العمل بالإسلام"],
        message: `  `,
        isTrue: "الدعاء مع العمل بالإسلام"
    },
    {
        question: " ما المقصود ب ذا النون  ",
        questions: [" يونس عليه السلام ", " ابراهيم عليه السلام "],
        message: ` واذكر أيها الرسول قصة صاحب الحوت يونس عليه السلام إذ ذهب دون إذن من ربه مغاضبا قومه لتماديهم في العصيان `,
        isTrue: " يونس عليه السلام "
    },




             {
            question: "ما هي الصلاة التي تصلى عند حدوث الكسوف؟",
            questions: ["صلاة الكسوف", "صلاة الاستسقاء"],
            message: ` فأما خسوف القمر فأكثر أهل العلم على أنها مشروعة له، فعلها ابن عباس، وبه قال عطاء والحسن والنخعي والشافعي وإسحاق.. إلى أن قال: وقال مالك: ليس لكسوف القمر سنة، وحكى عنه ابن عبد البر وعن أبي حنيفة أنهما قالا: يصلي الناس لخسوف القمر وحدانا ركعتين ركعتين ولا يصلون جماعة، لأن في خروجهم إليها مشقة، إلى أن قال أيضا: وعن ابن عباس أنه صلى بأهل البصرة في خسوف القمر ركعتين وقال: إنما صليت لأني رأيت رسول الله صلى الله عليه وسلم يصلي والله أعلم `,
            isTrue: "صلاة الكسوف",
          },
          {
            question: "ما هو الركن الأول من أركان الإسلام؟",
            questions: ["الشهادة", "الصلاة"],
            message: ` فأركان الإسلام خمسة: شهادة أن لا إله إلا الله، وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة، وصوم رمضان، وحج البيت، لمن استطاع إليه سبيلا `,
            isTrue: "الشهادة",
          },




                    {
            question: "من هو الصحابي الذي لقب بسيف الله؟",
            questions: ["خالد بن الوليد", "علي بن أبي طالب"],
            message: ` هو خالد بن الوليد بن مغيرة بن عمرو بن مخزوم بن كعب, ولد فب مكة المكرمة قبل الهجرة بأربعين سنه أي 580 م تقريبا, وترعرع بين فتيان قومه من قريش, وكان يُتقن الفروسية وله خاصة بين شباب قومه, كان رضي الله عنه قائد المجاهدين وسيف من سيوف الله تعالى, وهو فارس الإسلام والمسلمين `,
            isTrue: "خالد بن الوليد",
          },
          {
            question: ` لماذا ذكرت قصة سيدنا موسى اكثر من مره في القران الكريم `,
            questions: [" لأنها تخاطب بني إسرائيل أكثر من غيرهم ", " وجود التناسب الكبير بين شريعة موسى وشريعة نبينا محمد صلى الله عليه وسلم "],
            message: `الحمد لله والصلاة والسلام على رسول الله وعلى آله وصحبه, من أسباب تكرار قصة موسى مع فرعون أكثر من غيرها، وجود التناسب الكبير بين شريعة موسى وشريعة نبينا محمد صلى الله عليه وسلم، وبين كتابيهما ولهذا يكثر في القرآن ذكر موسى وكتابه وبعده ذكر القرآن العظيم. كما قال الله تعالى: وَلَقَدْ آتَيْنَا مُوسَى وَهَارُونَ الْفُرْقَانَ وَضِيَاءً وَذِكْراً لِلْمُتَّقِينَ* الَّذِينَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ وَهُمْ مِنَ السَّاعَةِ مُشْفِقُونَ* وَهَذَا ذِكْرٌ مُبَارَكٌ أَنْزَلْنَاهُ أَفَأَنْتُمْ لَهُ مُنْكِرُونَ [الأنبياء:48-49-50]. قال ابن القيم رحمه الله تعالى، في كتابه جلاء الأفهام: ولهذا يذكر الله سبحانه وتعالى قصة موسى عليه السلام ويعيدها ويبديها ويسلي رسول الله صلى الله عليه وسلم، ويقول رسول الله صلى الله عليه وسلم عندما يناله من أذى الناس: لقد أوذي موسى بأكثر من هذا فصبر. فتأمل هذا التناسب بين الرسولين والكتابين الشريفين والله أعلم `,
            isTrue: " وجود التناسب الكبير بين شريعة موسى وشريعة نبينا محمد صلى الله عليه وسلم ",
          },
          {
            question: " لماذا يجب علينا قراءة أذكار الصباح والمساء  ",
            questions: [" لأنها تريح القلب وتزيد من الحسنات ", " لانها وقاية للمسلم وتحصين له من الشرور "],
            message: ` الحمد لله والصلاة والسلام على رسول الله وعلى آله وصحبه, فالمواظبة على قراءة أذكار الصباح والمساء عبادة عظيمة، ووقاية للمسلم وتحصين له من الشرور فقد دلت النصوص على أن على المرء أن يواظب على أذكار الصباح والمساء، ومن هذه النصوص قول الله تعالى: (وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا) [طـه: من الآية130]، وقوله تعالى: (وَسَبِّحْ بِحَمْدِ رَبِّكَ بِالْعَشِيِّ وَالْأِبْكَارِ) [غافر: من الآية55]. إلى غير ذلك من الآيات والأحاديث، وهذه الأذكار كثيرة ومنها سيد الاستغفار: روى البخاري في صحيحه عن شداد بن أوس رضي الله عنه عن النبي صلى الله عليه وسلم قال: "سيد الاستغفار: اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك عليّ، وأبوء بذنبي، فاغفر لي، فإنه لا يغفر الذنوب إلا أنت" إذا قال ذلك حين يمسي فمات من ليلته دخل الجنة، وإذا قال ذلك حين يصبح فمات من يومه دخل الجنة، ومعنى أبوء: أقر وأعترف`,
            isTrue: " لانها وقاية للمسلم وتحصين له من الشرور ",
          },
          {
            question: "كم عدد السجدات في القرآن الكريم؟",
            questions: ["15", "14"],
            message: ` فمواضع السجود في القرآن خمسة عشر موضعاً، فعن عمرو بن العاص رضي الله عنه أن رسول الله صلى الله عليه وسلم أقرأه خمسة عشر سجدة، منها: ثلاث في المفصل وفي الحج سجدتان. رواه أبو داود والحاكم وابن ماجه والدراقطني وحسنه المنذري `,
            isTrue: "15",
          },
          {
            question: "من هو أول نبي أرسل إلى البشرية؟",
            questions: ["نوح عليه السلام", "إبراهيم عليه السلام"],
            message: ` الحمد لله والصلاة والسلام على رسول الله وعلى آله وصحبه، فإن أول نبي من رسل الله إلى البشرية بعد آدم عليه السلام هو نوح عليه السلام، كما ثبت عن غير واحد من أهل العلم، فقد روى الحاكم وغيره عن ابن عباس رضي الله عنهما قال: كان بين نوح وآدم عشرة قرون كلهم على شريعة من الحق فاختلفوا فبعث الله النبيين مبشرين ومنذرين وروى ابن جرير عن قتادة في قول الله تعالى: كَانَ النَّاسُ أُمَّةً وَاحِدَةً فَبَعَثَ اللَّهُ النَّبِيِّينَ مُبَشِّرِينَ وَمُنذِرِينَ {البقرة: 213} فكان أول نبي بُعث نوح عليه السلام`,
            isTrue: "نوح عليه السلام",
          },

*/


// Mange Questions
const contentQuestions = document.querySelector(".content-questions");
const currQuestions = {
    one: [
        {
            question: " من هو خاتم الأنبياء ؟",
            questions: [" ابراهيم", " محمد "],
            message: " سورة الأحزاب (40) ما كان محمد أبا أحد من رجالكم ولكن رسول الله وخاتم النبيين وكان الله بكل شيء عليما ",
            isTrue: " محمد "
    
        },
        {
            question: " أول زوجة لسيدنا محمد هي السيده خديجة ؟",
            message: ` وكان السادات والرؤساء يحرصون على زوجها فتأبى # السيده خديجة # أي رجال قريش يتقدمون لزوجها فاترفضهم , فتحدثت بما في نفسها إلى صديقتها نفيسة بنت منية وهذه ذهبت إليه # صلى الله عليه وسلم # تفاتحه أن يتزوج خديجة فرضي بذالك أي قبل الزواج # صلى الله عليه وسلم # وكلم أعمامه فذهبوا إلى عم خديجة وخطبوها إليه وعلى إثر ذالك تم الزواج وحضر العقد بنو هاشم ورؤساء مضر وذالك بعد رجوعه من الشام بشهرين وكانت سنها أربعين سنة وكانت يومئذ أفضل نساء قومها وثروة وعقلاً وهي أول امرأة تزوجها  صلى الله عليه وسلم 
            `,
            questions: [" لا ", " نعم "],
            isTrue: " نعم "
        },
        {
            question: " من هو النبي الذي فتن في قتل ولده ؟",
            questions: [" ابراهيم عليه السلام", " نوح عليه السلام"],
            message: ` سورة الصافات (102)   فلما بلغ معه السعي قال يا بنَيَّ إني أرى في المنام أني أذبحك فانظر ماذا ترى قال يا أبت افعل ما تؤمر ستجدني إن شاء الله من الصابرين التفسير:  فلما شب إسماعيل عليه السلام وأدرك سعيه سعي أبيه إبراهيم عليه السلام رؤيا الأنبياء وحي قال إبراهيم مخبرًا ابنه عن فحوى هذه الرؤيا: يا بني إني رأيت في النوم أني اذبحك فانظر ما ترى في ذلك فأجاب إسماعيل عليه السلام أباه قائلًا يا أبي افعل ما أمرك الله به من ذبحي ستجدني إن شاء الله من الصابرين أي من الراضين بحكم الله #`,
            isTrue: " ابراهيم عليه السلام",
        },
        {
            question: " من هم قوم سيدنا هود ؟",
            questions: [" عاد ", " ثمود "],
            message: ` سورة الأعراف (65)  وإلى عاد أخاهم هودا قال يقوم اعبدوا الله ما لكم من إله غيره أفلا تتقون`,
            isTrue: " عاد "
        },
        {
            question: "من آداب دخول البيت نقول السلام على أهل البيت",
            questions: [" صح ", " خطأ "],
            message: ` عن إنس قال: قال # رسول الله صلى الله عليه وسلم # يا بني إذا دخلت على أهلك فسلم يكن بركة عليك وعلى أهل بيتك رواه الترمذي وقال: حديث صحيح`,
            isTrue: " صح "
        },
        {
            question: "ما معنى قوله تعالى: (ويمنعون الماعون)؟",
            questions: [" يمنعون إعارة ما لا تضر من الآنية وغيرها ", " يمعنون الناس عن معاني الحق "],
            message: ` أي يمنعون إعارة ما لا تضر من الآنية وغيرها , فلا هم أحسنوا عبادة ربهم ولا هم أحسنوا إلى خلقه  `,
            isTrue: " يمنعون إعارة ما لا تضر من الآنية وغيرها "
        },
        {
        question: " لماذا نلتزم الأخلاق الأسلامية؟ ",
        questions: [" لأنها سبب لكسب الاموال ", " لأنها سبب لمحبة الله ومحبة خلقه "],
        message: ` وعن أبي هريره قال: سُئل رسول الله # صلى الله عليه وسلم # عن أكثر ما يدخل الناس الجنة قال: تقوى الله وحسُن الخُلُق وسُئل عن أكثر ما يدخل الناس النار فقال الفمُ و الفَرجُ رواه الترمذي وقال: حديث صحيح `,
        isTrue: " لأنها سبب لمحبة الله ومحبة خلقه "
    },
    {
        question: " توفى ابوه سيدنا محمد صلى الله عليه وسلم وهو؟",
        questions: [" طفل صغر ", " في بطن امه "],
        message: ` وبعد قليل أرسله عبد المطلب إلى المدينة يمتار لهم تمراً فمات بها وقيل: بل خرج تاجراً إلى الشام فأقبل في عير قريش فنزل بالمدينة وهو مريض فتوفى بها ودفن في دار النابغة الجعدي وله إذ ذاك خمس وعشرون سنة وكانت وفاته قبل أن يولد رسول الله صلى الله عليه وسلم `,
        isTrue: " في بطن امه "
    },
    {
        question: " صلاة الفرد أفضل من صلاة الجماعة بسبع وعشرين درجة ",
        questions: [" صح ", " خطأ "],
        message: ` صلاة الجماعة أفضل من صلاة الفرد بسبع وعشرين درجة. قال رسول الله # صلى الله عليه وسلم # صلاة الجماعة تفضل صلاة الفذ بسبع وعشرين درجة `,
        isTrue: " خطأ ",
    },
    {
        question: " ما أعظم ذنب؟ ",
        questions: [" الشرك بالله تعالى ", " قطيعة الرحم "],
        message: ` سألتُ رسول الله # صلى الله عليه وسلم # أي الذنب أعظم قال: الشركُ أن تجعل مع الله ند # ومعنى ندا أي المثل والنظير والضد والشريك # و أن تزني يحليلة جاركَ # ومعنى أن تزني بحليلة جارك أي أن تزني مع امرأة جارك # وأن تقتل ولدكَ  على الخوف من الفقر أن يأكل معك  ثم قرأ عبدالله بن مسعود: والّذين لا يَدعُون مَعَ اللهِ إِلها آخرَ`,
        isTrue: " الشرك بالله تعالى ",
    },
    {
        question: " من أركان الحج ",
        questions: [" الوقوف بعرفة ", " الوقوف بمكة "],
        message: ` قال المصنف رحمه الله تعالى ( ثم يروح إلى عرفة ويقف ، والوقوف ركن من أركان الحج ، لما روى عبد الرحمن الديلي أن رسول الله صلى الله عليه وسلم قال: الحج عرفات ، فمن أدرك عرفة قبل أن يطلع الفجر فقد أدرك الحج `,
        isTrue: " الوقوف بعرفة "
    },
    {
        question: "من آداب المجلس: السلام على أهل المجلس عند الدخول وعند الخروج",
        questions: ["صح", " خطأ "],
        message: ` من السنة إلقاء السلام عند دخول المجلس وعند الخروج منه. قال رسول الله إِذَا انْتَهَى أَحَدُكُمْ إِلَى الْمَجْلِسِ فَلْيُسَلِّمْ ، فَإِذَا أَرَادَ أَنْ يَقُومَ فَلْيُسَلِّمْ ؛ فَلَيْسَتْ الْأُولَى بِأَحَقَّ مِنْ الْآخِرَةِ. صححه الألباني في "صحيح أبي داود" وغيره `,
        isTrue: "صح"
    },
    {
        question: "مكان ولادة النبي صلى الله عليه وسلم:",
        questions: ["في مكة", "في المدنية"],
        message: ` شهر مولده صلى الله عليه وسلم، وكيف يكون الحمل قد حصل في أيام التشريق والولادة في ربيع الأول، فتكون مدة الحمل أربعة أشهر فقط !! فهذا لأن السائل لم يراع الخلاف الحاصل في شهر مولده صلى الله عليه وسلم، فإن من قال: الحمل كان في أيام التشريق. قال: إن الميلاد كان في شهر رمضان. وهذا قول الزبير بن بكار، ونصه: حملت به أمه في أيام التشريق في شعب أبي طالب عند الجمرة الوسطى. وولد بمكة بالدار المعروفة بدار محمد بن يوسف أخي الحجاج بن يوسف لثنتي عشرة ليلة خلت من شهر رمضان`,
        isTrue: "في مكة"
    },  
    {
        question: "من دعاء الضيف لصاحب الطعام: (اللهم بارك لهم فيما رزقتهم، واغفر لهم وارحمهم)",
        questions: ["صح", "خطأ"],
        message: `      
        وهو ما جاء عن عبدالله بن بسرٍ  قال: نزل رسولُ الله وعليه وسلم على أبي، قال: فقرّبنا إليه طعامًا ووطبةً، فأكل منها، ثم أُتي بتمرٍ فكان يأكله، ويُلقي النَّوى بين أُصبعيه، ويجمع السَّبابة والوسطى، قال شُعبة: هو ظنّي، وهو فيه -إن شاء الله- إلقاء النَّوى بين الأصبعين، ثم أُتي بشرابٍ فشربه، ثم ناوله الذي عن يمينه، قال: فقال أبي -وأخذ بلجام دابَّته-: ادعُ الله لنا. فقال: اللهم بارك لهم فيما رزقتهم، واغفر لهم، وارحمهم أخرجه الإمامُ مسلم في "صحيحه.
        `,
        isTrue: "صح"
    
    },
    {
        question: "ما معنى قوله تعالى: فأمه هاوية",
        questions: ["مأوه ومسكنه النار التي من أسمائها الهاوية تكون له بمنزلة الام الملازمة", "أمه التي ولدته"],
        message: `   أي: مأوه ومسكنه النار التي من أسمائها الهاوية تكون له بمنزلة الام الملازمة كما قال الله تعالى: أن عَذابَهَا كَانَ غَرمًا وقيل: أن معنى ذلك فأم دماغه هاوية في النار أي: يلقى في النار على رأسه`,
        isTrue: "مأوه ومسكنه النار التي من أسمائها الهاوية تكون له بمنزلة الام الملازمة"
    },
    ],
    two: [
        {
            question: "ما اسم الكتاب الذي أنزل على النبي محمد صلى الله عليه وسلم؟",
            questions: ["القرآن الكريم", "الإنجيل"],
            message: ` الكتب السماوية النازلة على الرسل، والحديث الوارد بحصرها حديث باطل وأما ترتيب نزول المعلوم منها، فهو على حسب زمن الرسل فقد أنزل الله تعالى على إبراهيم عليه السلام الصحف، وعلى داود عليه السلام الزبور، وعلى موسى عليه السلام التوراة والصحف، وعلى عيسى عليه السلام الإنجيل، وعلى نبينا محمد صلى الله عليه وسلم القرآن. ويجب على المسلم أن يؤمن بما لم يعلمه منها إجمالاً، كما قال تعالى: وَقُلْ آمَنْتُ بِمَا أَنْزَلَ اللَّهُ مِنْ كِتَابٍ[الشورى:15]. ويجب عليه اتباع آخرها والعمل بما فيه وهو القرآن الكريم؛ لأن ما سواه إن سلم من التحريف والتبديل، فهو منسوخ به؛ كما قال تعالى: وأنزلنا إليك الكتاب بالحق مصدقاً لمَا بينَ يديه من الكتاب ومهيمناً عليه[المائدة:48]. والله أعلم. `,
            isTrue: "القرآن الكريم",
          },
          {
            question: "كم عدد أركان الإسلام؟",
            questions: ["5", "7"],
            message: ` أركان الإسلام خمسة: شهادة أن لا إله إلا الله، وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة، وصوم رمضان، وحج البيت، لمن استطاع إليه سبيلا. `,
            isTrue: "5",
          },
          {
            question: "ما هو أول مسجد بني في الإسلام؟",
            questions: ["مسجد قباء", "المسجد الأقصى"],
            message: `  أول مسجد بني في الإسلام هو مسجد قباء، قال الحافظ في فتح الباري: فهو أي مسجد قباء في التحقيق أول مسجد صلى النبي صلى الله عليه وسلم فيه بأصحابه جماعة ظاهراً، وأول مسجد بني لجماعة المسلمين عامة. `,
            isTrue: "مسجد قباء",
          },
          {
            question: "ما هي السورة التي تعادل ثلث القرآن؟",
            questions: ["سورة الإخلاص", "سورة الفاتحة"],
            message: ` فقد روى البخاري من حديث أبي سعيد رضي الله عنه أن رجلا سمع رجلا يقرأ قل هو الله أحد يرددها، فلما أصبح جاء إلى رسول الله صلى الله عليه وسلم فذكر ذلك له، وكأن الرجل يتقالها، فقال رسول الله صلى الله عليه وسلم: والذي نفسي بيده إنها لتعدل ثلث القرآن. وورد في فضلها أحاديث أخرى وقد اختلف أهل العلم في معنى تلك الأحاديث اختلافا كبيرا، فمنهم من رأى أنها ثلثه باعتبار المعنى، ومنهم ما قال إنها ثلثه باعتبار الثواب، ومنهم من رأى غير ذلك `,
            isTrue: "سورة الإخلاص",
          },
          {
            question: "كم عدد الصلوات المفروضة يوميًا؟",
            questions: ["5", "3"],
            message: ` الحمد لله، والصلاة والسلام على رسول الله، وعلى آله وصحبه، أما بعد فالصلوات المفروضة على المسلم خمس، وهي: الظهر أربع ركعات، والعصر أربع ركعات، والمغرب ثلاث ركعات، والعشاء أربع ركعات، والصبح ركعتان، قال رسول الله صلى الله عليه وسلم: أمّني جبريل - عليه السلام - عند البيت مرتين، فصلي بي الظهر، حين زالت الشمس، وكانت قدر الشراك، وصلى بي العصر، حين كان ظله مثله، وصلى بي المغرب، حين أفطر الصائم، وصلى بي العشاء، حين غاب الشفق، وصلى بي الفجر، حين حرم الطعام والشراب على الصائم، فلما كان الغد، صلى بي الظهر، حين كان ظله مثله، وصلى بي العصر، حين كان ظله مثليه، وصلى بي المغرب، حين أفطر الصائم، وصلى بي العشاء، إلى ثلثي الليل، وصلى بي الفجر، فأسفر، ثم التفت إليّ، وقال: يا محمد، هذا وقت الأنبياء من قبلك، والوقت ما بين هذين الوقتين. رواه أحمد، وأبو داود، والترمذي، والحاكم من حديث ابن عباس -رضي الله عنهما والله اعلم `,
            isTrue: "5",
          },
          {
            question: "ما هي قبلة المسلمين في الصلاة؟",
            questions: ["الكعبة", "المسجد النبوي"],
            message: ` تعتبر الكعبة المشرفة قبلة المسلمين التي يتوجهون إليها في صلاتهم بناءً على أمر الله تعالى وهذه القبلة هي قبلة إبيهم إبراهيم عليه السلام من قبل وقد جاء الإمر الرباني باتخاذ الكعبة كقبلة في الصلاة في قوله تعالى: # قد نرى نقلب وجهك في السماء فلنولينك قبلة ترضاها فول وجهك شطر المسجد الرحام وحيث ما كنتم فولوا وجوهكم شطره وإن الذين أتوا تاكتاب ليعلمون أنه الحق من ربهم وما الله بغافل عما يعملون # وذكر العلّامة ابنُ جرير الطبريّ أنّ النبي عليه الصلاة والسلام اتخذ بيت المقدس أوّل قبلة له في الصلاة قبل الهجرة النبوية، وقد اقتدت الأنصار به في ذلك نحو ثلاثِ حجج، وبعد هجرته إلى المدينة المنورة بقي النبي الكريم يصلي إلى بيت المقدس نحو ستةَ عشرَ شهراً قبل أن يُؤمر بالتوجّه إلى الكعبة المشرّفة`,
            isTrue: "الكعبة",
          },
          {
            question: " لماذا حرم الله الزنا ",
            questions: [" لانه يسبب خلل بالمجتمع ويفسده ولأن فيه إفساد النساء على أزواجهن والأبكار على أوليائهن ", " لانه يسبب المشاكل بين المتزوجين "],
            message: " فإن الله حرم الزنا لما يسببه من هتك الأعراض والعزوف عن الزواج واختلاط الأنساب وانتشار الأمراض الفتاكة. مثل السفلس والأيدز. إضافة إلى عقاب الله العظيم في الآخرة والحد في الدنيا، ثم إن المسلم يجب عليه الانقياد لأمر الله سواء عرف الحكمة منه أم لم يعرفها. وراجع للزيادة في الموضوع، وفي الأسباب المساعدة على البعد عن هذه الفاحشة الشنيعة والقبيحة ",
            isTrue: " لانه يسبب خلل بالمجتمع ويفسده ولأن فيه إفساد النساء على أزواجهن والأبكار على أوليائهن ",
          },
          {
            question: "ما أول ما نزل من القرآن الكريم",
            questions: ["اقرَأ بِاسْم رَبِّك", "الحمد"],
            message: ` وفي مجموع الفتاوى لشيخ الاسلام: أول ما أنزل من القرآن "اقْرَأْ بِاسْمِ رَبِّكَ" عند جماهير العلماء. وقد قيل "يَا أَيُّهَا الْمُدَّثِّرُ" روي ذلك عن جابر. والأول أصح. فإن ما في حديث عائشة الذي في الصحيحين يبين أن أول ما نزل # اقرَأ بِاسْم رَبِّك # نزلت عليه وهو في غار حراء وأن "المدثر" نزلت بع `,
            isTrue: "اقرَأ بِاسْم رَبِّك",
          },
          {
            question: "ما هو الشهر الذي يصوم فيه المسلمون؟",
            questions: ["شهر رمضان الكريم", "ذو الحجة"],
            message: ` قال الله تعالى: شهر رمضان الذي أنزل فيه القرءان هدى للناس وبينات من الهدى والفرقان فمن شهد منكم الشهر فليصمه ومن كان مريضا أو على سفر عدة من أيام أخر يريد الله بكم اليسر ولا يريد بيكم العسر ولتكملوا العدة ولتكبروا الله عل ما هداكم ولعلكم تشكرون `,
            isTrue: "شهر رمضان الكريم",
          },
          {
            question: "ما اسم الليلة التي هي خير من ألف شهر؟",
            questions: ["ليلة القدر", "ليلة الاسراء والمعراج"],
            message: ` 
            إِنَّا أَنزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ (1)
            وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ (2)
            لَيْلَةُ الْقَدْرِ خَيْرٌ مِّنْ أَلْفِ شَهْرٍ (3)
            تَنَزَّلُ الْمَلائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِم مِّن كُلِّ أَمْرٍ (4)
            سَلامٌ هِيَ حَتَّى مَطْلَعِ الْفَجْرِ (5)
            `,
            isTrue: "ليلة القدر",
          },
          {
            question: "ما هي الزكاة؟",
            questions: ["صدقة مفروضة", "صدقة تطوعية"],
            message: ` فالزكاة في اللغة مشتقة من الزكاء وهو النماء والزيادة وسمي ما يخرج من المال للمساكين بإيجاب الشرع زكاة لأنها تزيد في المال الذي أخرجت منه وتوفره وتقيه الآفات 
والزكاة في الشرع عرفت بتعريفات منها أنها حق يجب في المال ومنها أنها اسم لأخذ شيء مخصوص من مال مخصوص على أوصاف مخصوصة لطائفة مخصوصة
والزكاة ركن من أركان الإسلام الخمسة الثابتة بالكتاب والسنة والإجماع كما قال رسولنا صلى الله عليه وسلم # تؤخذ من أغنيائهم وترد على فقرائهم # متفق عليه فهي فريضة فرضها الله عبادة للموسرين، ولطفاً ورحمة بالفقراء والمحتاجين يقول السيد محمد رشيد رضا في تفسيره:  ولو أقام المسلمون هذا الركن من دينهم لما وجد فيهم - بعد أن كثرهم الله ووسع عليهم في الرزق - فقير مدقع، ولا ذو غرم مفجع، ولكن أكثرهم تركوا هذه الفريضة فجنوا على دينهم وأمتهم فصاروا أسوأ من جميع الأمم حالاً في مصالحهم المالية والسياسية، حتى فقدوا ملكهم وعزهم وشرفهم `,
            isTrue: "صدقة مفروضة",
          },
          {
            question: "من هو أول خليفة للمسلمين؟",
            questions: ["أبو بكر الصديق", "عمر بن الخطاب"],
            message: ` قَوْلُهُ: وَنُثْبِتُ الْخِلَافَةَ بَعْدَ رَسُولِ اللَّهِ ﷺ أَوَّلًا لِأَبِي بَكْرٍ الصِّدِّيقِ ، تَفْضِيلًا لَهُ وَتَقْدِيمًا عَلَى جَمِيعِ الْأُمَّةِ

اخْتَلَفَ أَهْلُ السُّنَّةِ فِي خِلَافَةِ الصِّدِّيقِ هَلْ كَانَتْ بِالنَّصِّ أَوْ بِالِاخْتِيَارِ؟

فَذَهَبَ الْحَسَنُ الْبَصْرِيُّ وَجَمَاعَةٌ مِنْ أَهْلِ الْحَدِيثِ إِلَى أَنَّهَا ثَبَتَتْ بِالنَّصِّ الْخَفِيِّ وَالْإِشَارَةِ، وَمِنْهُمْ مَنْ قَالَ: بِالنَّصِّ الْجَلِيِّ. وَذَهَبَ جَمَاعَةٌ مِنْ أَهْلِ الْحَدِيثِ وَالْمُعْتَزِلَةِ وَالْأَشْعَرِيَّةِ إِلَى أَنَّهَا ثَبَتَتْ بِالِاخْتِيَارِ.

وَالدَّلِيلُ عَلَى إِثْبَاتِهَا بِالنَّصِّ أَخْبَارٌ:

مِنْ ذَلِكَ مَا أَسْنَدَهُ الْبُخَارِيُّ عَنْ جُبَيْرِ بْنِ مُطْعِمٍ قَالَ: أَتَتِ امْرَأَةٌ النَّبِيَّ ﷺ، فَأَمَرَهَا أَنْ تَرْجِعَ إِلَيْهِ، قَالَتْ: أَرَأَيْتَ إِنْ جِئْتُ فَلَمْ أَجِدْكَ؟ كَأَنَّهَا تُرِيدُ الْمَوْتَ، قَالَ: إِنْ لَمْ تَجِدِينِي فَأْتِي أَبَا بَكْرٍ. وَذَكَرَ لَهُ سِيَاق الحديث، وَأَحَادِيث أُخَرَ. وَذَلِكَ نَصٌّ عَلَى إِمَامَتِهِ.

وَحَدِيثُ حُذَيْفَةَ بْنِ الْيَمَانِ قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: اقْتَدُوا بِاللَّذَيْنِ مِنْ بَعْدِي: أَبِي بَكْرٍ وَعُمَرَ `,
            isTrue: "أبو بكر الصديق",
          },
          {
            question: `ما المقصود بقوله تعالى: الَذِينَ جَعَلُوا القُرءَانَ عِضِينَ `,
            questions: [" هم الذين كفرو ", " هم الذين جعلوا القرآن أقساما وأجزاء "],
            message: ` هم الذين حعلوا القرآن أقساما وأجزاء فمنهم من يقول سحر ومنهم من يقول كهانة ومنهم من يقول غير ذلك يصرفونه بحسب أهوائهم ليصدوا الناس عن الهدى `,
            isTrue: " هم الذين جعلوا القرآن أقساما وأجزاء ",
          },
        {
        question: " ما هو عدد أركان الصلاة ",
        questions: [" أربعة عشر ركن ", " سبعة وعشرون ركن ",],
        message: ` وأركان الصَّلاة أربعة عشر: القيام مع القُدرة، وتكبيرة الإحرام، وقراءة الفاتحة، والركوع، والرفع منه، والسجود على الأعضاء السَّبعة، والاعتدال منه، والجلسة بين السَّجدتين، والطُّمأنينة في جميع الأركان، والترتيب، والتَّشهد الأخير، والجلوس له، والصَّلاة على النبي عليه وسلم والتَّسليمتان `,
        isTrue: " أربعة عشر ركن ",
    },
          {
            question: "من هو النبي الذي ابتلعه الحوت؟",
            questions: ["يونس عليه السلام", "موسى عليه السلام"],
            message: ` قال الله تعالى: وَذَا النُون إِذ ذَهَب مُغاضباً فَظَن أَن لَن نَقدرَ عَلَيه فَنَادَى فيِ الظُلُمَاتِ أَن لاَ إلَهَ إِلا أَنتَ سُبحانك إِنَي كُنتُ منَ الظَالِمينَ وفي قوله تعالى: وإن يُوُنَس لَمنَ المُرسَلينَ # إِذ أَبَقَ إلَى الفُلك المَشحُون # فَسَاهَم فَكَانَ منَ المُدحَضِينَ # فَالتَقَمهُ الحُوتُ وهُو مُليم # فَلَولَاَ أَنهُ كَانَ منَ المُسبحِينَ # لَلَبثَ في بَطنِهِ إلَى يومِ يُبعثُونَ `,
            isTrue: "يونس عليه السلام",
          },
    ],
    three: [
        {
            question: ` من هوأكثر نبي ذُكر في القرآن؟ `,
            questions: [" إبراهيم عليه السلام ", " موسى عليه السلام "],
            message: ` الحمد لله والصلاة والسلام على رسول الله وعلى آله وصحبه, فإن أكثر الأنبياء ذكر باسمه في القرآن هو موسى عليه وعلى جميع الأنبياء الصلاة والسلام، وقد تكرر اسمه في القرآن ستا وثلاثين ومائة مرة، كما قال محمد فؤاد عبد الباقي في المعجم المفهرس لألفاظ القرآن، ولعل من حكم تكرار اسمه في القرآن أن الله تعالى فصل في حياة موسى ما لم يفصل في حياة الأنبياء الآخرين، فقد ذكر مراحل حياته من الطفولة، وما تعرض له من الفتون، وأمر أمه برضاعه ووضعه في التابوت وإلقائه في البحر، ثم ذكر رضاعها له بعد الوصول لبيت فرعون، ثم ذكر مراحل من شبابه ومنها: قصته مع الرجلين وذهابه لمدين ومكثه فيها وبعثته بعد ذلك، وفصل في دعوته للكفار كفراً مطبقاً وهم الأقباط ودعوته للمتدينين المنحرفين وهم بنو إسرائيل، وذكر هلاك فرعون وقومه وقصته مع السحرة ثم معاناته مع قومه بعد عبورهم البحر وبعد عبادتهم العجل وبعد تحريضهم على الذهاب للأرض المقدسة إلى غير ذلك والله أعلم`,
            isTrue: " موسى عليه السلام ",
          },
          {
            question: ` ما اسم الصلاة التي هي الأفضل من بعد الفريضة `,
            questions: ["قيام الليل", "صلاة الرواتب"],
            message: ` فقد روى مسلم في صحيحه عن أبي هريرة رضي الله عنه يرفعه -أي إلى النبي صلى الله عليه وسلم- أنه سئل: أي الصلاة أفضل بعد المكتوبة، وأي الصيام أفضل بعد شهر رمضان؟ فقال: أفضل الصلاة بعد الصلاة المكتوبة الصلاة في جوف الليل، وأفضل الصيام بعد شهر رمضان صيام شهر الله المحرم. فهذا تفضيل في جنس الصلاة، فقيام الليل أفضل الصلوات بعد الفريضة `,
            isTrue: "قيام الليل",
          },
          {
            question: "من هو النبي الذي أُمر ببناء السفينة؟",
            questions: ["نوح عليه السلام", "إبراهيم عليه السلام"],
            message: ` فلما شكا نوح إلى الله واستنصره عليهم ، أوحى الله إليه أن : اصنع الفلك بأعيننا ووحينا ولا تخاطبني في الذين ظلموا إنهم مغرقون فأقبل نوح على عمل الفلك وهي السفينة العظيمة التي لم يكن لها نظير قبلها ، ولا يكون بعدها مثلها ، وتقدم الله تعالى إليه أنه إذا جاء أمره  وحل بهم بأسه الذي لا يرد عن القوم المجرمين أنه لا يعاوده فيهم ولا يراجعه  فإنه لعله قد تدركه رقة على قومه عند معاينة العذاب النازل بهم ، فإنه ليس الخبر كالمعاينة  ولهذا قال : ولا تخاطبني في الذين ظلموا إنهم مغرقون ويصنع الفلك وكلما مر عليه ملأ من قومه سخروا منه  أي يستهزئون به استبعادا لوقوع ما توعدهم به قال إن تسخروا منا فإنا نسخر منكم كما تسخرون . أي : نحن الذين نسخر منكم ، ونتعجب منكم في استمراركم على كفركم `,
            isTrue: "نوح عليه السلام",
          },
          {
            question: " هل الكذب معصية كبيره من الكبائر ",
            questions: [" لا ", " نعم "],
            message: ` السلام عليكم ورحمة الله بسم الله الرحمن الرحيم فإن الصدق يهدي إلى البر وإن البر يهدي إلى الجنة، ولا يزال الإنسان يصدق ويتحرى الصدق حتى يكتب عند الله صديقاً والمؤمن لا يكون كذاباً أبداً، ولعنة الله على الكاذبين وكان رسولنا صلى الله عليه وسلم ينفر من الكذاب حتى يعلم أنه أحدث توبة، وحتى أهل الجاهلية كانوا يذمون الكذب، وقد رفض أبو سفيان حين كان قائداً للمشركين أن يكذب عندما سئل عن رسول رب العالمين صلى الله عليه وسلم وقال: خشيت أن تكتب علي كذبة واعلم أن الكذب يهدي إلى الفجور والفجور يهدي إلى النار ولا يزال الإنسان يكذب ويتحرى الكذب حتى يُكتب عند الله كذاباً والكذب معصية وكبيرة من الكبائر وللمعاصي شؤمها وأثرها والإنسان مطالب بالبحث عن أهل الخير والصدق، قال تعالى: (يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَكُونُوا مَعَ الصَّادِقِينَ)[التوبة:119]`,
            isTrue: " نعم ",
          },
          {
            question: " ما هي عقوبة الزاني المحصن والغير محصن ومحصن بمعنى متزوج ",
            questions: [" عقوبتهم مائة جلدة ", " عقوبة المحصن يجلد حتى الموت اما الغير محصن فا يجلد مائة جلدة "],
            message: ` الحمد لله والصلاة والسلام على رسول الله وعلى آله وصحبه، أما بعد: فإن كان الزاني محصناً حراً فعقوبته الرجم حتى الموت رجلاً كان أو امرأة وهذا محل إجماع بين العلماء ودليل ذلك حديث ابن عباس في صحيح البخاري في قصة رجم الصحابي الذي زنى واسمه ماعز وكذلك ما رواه مسلم في قصة رجم المرأة الغامدية التي زنت وذهب الإمام أحمد في رواية عنه إلى أن حد الزاني المحصن الجلد ثم الرجم، والمذهب عند الحنابلة الرجم فقط وأما إن كان غير محصن فحده الجلد إن كان حراً لقول الله تعالى: الزَّانِيَةُ وَالزَّانِي فَاجْلِدُوا كُلَّ وَاحِدٍ مِنْهُمَا مِائَةَ جَلْدَةٍ وَلا تَأْخُذْكُمْ بِهِمَا رَأْفَةٌ فِي دِينِ اللَّهِ إِنْ كُنْتُمْ تُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَلْيَشْهَدْ عَذَابَهُمَا طَائِفَةٌ مِنَ الْمُؤْمِنِينَ [النور:2] وكون من زنى بها كافرة لا يدرأ الحد عنه هذا إذا وصل إلى الحاكم المسلم أما إذا لم يصل أمره إلى الحاكم فينبغي له أن يستر نفسه وعليه أن يبادر بالتوبة إلى الله عز وجل قبل أن يوافيه الأجل وحينها سيندم حين لا ينفعه الندم والله أعلم `,
            isTrue: " عقوبة المحصن يجلد حتى الموت اما الغير محصن فا يجلد مائة جلدة ",
          },
          {
            question: ` ما هو اسم أم النبي محمد صلى الله عليه وسلم `,
            questions: ["آمنة بنت وهب", "خديجة بنت خويلد"],
            message: ` فأم النبي صلى الله عليه وسلم هي آمنة بنت وهب، ووالدها هو وهب بن عبد مناف بن زهرة بن كلاب بن مرة بن كعب بن لؤلي، وأمها برة بنت عبد العزى بن عثمان بن عبد الدار بن قصي بن كلاب، وأم برة هي أم حبيب بنت أسد وأم أم حبيب هي برة بنت عوف بن عبيد بن عويج وأم برة بنت عوف هي قلابة بنت الحارث بن مالك والله أعلم`,
            isTrue: "آمنة بنت وهب",
          },
          {
            question: "ما هي السورة التي تسمى قلب القرآن؟",
            questions: ["سورة يس", "سورة البقرة"],
            message: ` السلام عليكم و رحمة الله و بركاته ، و بعد :
سورة يس و التي هي السورة رقم ( 36 ) حسب تسلسل السور في المُصحف الشريف هي قلب القرآن الكريم حسب ما ورد في الأحاديث و الروايات الشريفة المروية عن المعصومين ( عليهم السلام ) ، فقد رَوى أبو بَصِيرٍ عَنْ الإمام جعفر بن محمد الصادق ( عليه السلام ) سادس أئمة أهل البيت ( عليهم السلام ) أَنه قال: إن لكل شئ قلبا وقلب القرآن  يس  من قرأها قبل أن ينام أو في نهاره قب أن يمسى كان في نهاره من المحفوظين والمرزوقين حتى يمسى ومن قرأها في ليلة قبل أن ينام وَكَل الله به مائة ألف ملك يحفظونه من كل شيطان رجيم ومن كل آفة وإن مات في يومه أدخله الله الجنة`,
            isTrue: "سورة يس",
          },
          {
            question: "متى فُرضت الصلاة على المسلمين",
            questions: ["بعد هجرة سيدنا محمد صلى الله عليه وسلم", "قبل هجرة سيدنا محمد صلى الله عليه وسلم"],
            message: ` عن أنس رضي الله عنه قال: ثم رُفع برسول الله صلى الله عليه وسلم إلى سدرة المنتهى، فأوحى الله إليه ما أوحى، وفرضت عليه الصلاة خمسين صلاة كل يوم، فأوصاه موسى عليه السلام أن يعود إلى ربه يسأله التخفيف، فما زال النبي صلى الله عليه وسلم يفعل حتى أصبحت خمسا بدل الخمسين.. وعاد رسول الله صلى الله عليه وسلم إلى بيت المقدس، فصلى بالمسجد الأقصى صلاة الصبح إماما والأنبياء خلفه وقد أجمع العلماء على أن الصلوات الخمس لم تُفْرَض إلا في هذه الليلة، قال ابن كثير: فلما كان ليلة الإسراء قبل الهجرة بسنة ونصف، فرض الله على رسوله صلى الله عليه وسلم الصلوات الخمس وفصَّل شروطها وأركانها وما يتعلق بها بعد ذلك، شيئا فشيئا وقال ابن رجب: "وقد أجمع العلماء على أن الصلوات الخمس إنما فرضت ليلة الإسراء `,
            isTrue: "قبل هجرة سيدنا محمد صلى الله عليه وسلم",
          },
          {
            question: "من هو النبي الذي كلمه الله بدون واسطة؟",
            questions: ["موسى عليه السلام", "إبراهيم عليه السلام"],
            message: ` الحمد لله والصلاة والسلام على رسول الله وعلى آله وصحبه أما بعد: سيناء من أرض مصر وفيها جبل الطور وهو الذي يضاف إلى سيناء قال تعالى: # وشجرة تخرج من طور سيناء تنبت بالدهن # [المؤمنون: 20] وقال تعالى : # والتين والزيتون * وطور سينين # [التين 1-2] وهو الجبل الذي كلم الله تعالى عليه سيدنا موسى بن عمران عليه السلام ونودي فيه `,
            isTrue: "موسى عليه السلام",
          },
          {
            question: "من هو النبي الذي كان يفسر الأحلام؟",
            questions: ["يوسف عليه السلام", "داوود عليه السلام"],
            message: ` السلام عليكم ورحمة الله وبركاته فإن النبي الذ ي كان يفسر الأحلام فهو سيدنا يوسف عليه السلام فقد فسر أحلام الرجلين الذين كانا معه في السجن في قوله تعالى: وَدَخَلَ مَعَهُ السِّجْنَ فَتَيَانِ ۖ قَالَ أَحَدُهُمَا إِنِّي أَرَانِي أَعْصِرُ خَمْرًا ۖ وَقَالَ الْآخَرُ إِنِّي أَرَانِي أَحْمِلُ فَوْقَ رَأْسِي خُبْزًا تَأْكُلُ الطَّيْرُ مِنْهُ ۖ نَبِّئْنَا بِتَأْوِيلِهِ ۖ إِنَّا نَرَاكَ مِنَ الْمُحْسِنِينَ (36) أي أخبرنا يا يوسف بتفسير ما رأينا إنا نراك من أهل الإحسان و عندما فسر النبي يوسف عليه السلام أحلامهم في قوله تعالى:  يَا صَاحِبَيِ السِّجْنِ أَمَّا أَحَدُكُمَا فَيَسْقِي رَبَّهُ خَمْرًا وَأَمَّا الآخَرُ فَيُصْلَبُ فَتَأْكُلُ الطَّيْرُ مِنْ رَأْسِهِ قُضِيَ الأَمْرُ الَّذِي فِيهِ تَسْتَفْتِيَانِ (41) قال أبو جعفر : يقول جل ثناؤه، مخبرًا عن قِيل يوسف للذين دخلا معه السجن: يا صاحبي السجن أما أحدكما فيسقي ربه خمرا هو الذي رأى أنه يعصر خمرًا ، فيسقي ربَّه  يعني سيده وهو ملكهم ، " خمرا " ، يقول: يكون صاحب شرابه وأما الآخر وهو الذي رأى أن على رأسه خبزًا تأكل الطير منه " فيصلب فتأكل الطير من رأسه " فذكر أنه لما عبَر ما أخبراه به أنهما رأياه في منامهما قالا له: ما رأينا شيئًا ! فقال لهما: قضي الأمر الذي فيه تستفتيان يقول: فُرغ من الأمر الذي فيه استفتيتما ووجب حُكم الله عليكما بالذي أخبرتكما به `,
            isTrue: "يوسف عليه السلام",
          },
          {
            question: "ما هي الليلة التي أسرى فيها النبي محمد صلى الله عليه وسلم",
            questions: ["ليلة الإسراء والمعراج", "ليلة القدر"],
            message: ` الإسراء والمعراج معجزة كبرى أرى اللهُ عز وجل فيها نبيه محمداً صلى الله عليه وسلم من عظيم آياته أمَّا الإسراء فيُقصد به الرحلة العجيبة بالقياس إلى مألوف وقوانين البشر من المسجد الحرام بمكة إلى المسجد الأقصى بالقدس وأمَّا (المعراج) فهو الرحلة السماويَّة من عالم الأرض إلى عالم السماء حيث سدرة المنتهى ثم الرجوع بعد ذلك إلى المسجد الحرام وقد حدثت هاتان الرحلتان في ليلة واحدة قبل الهجرة النبوية إلى المدينة المنورة وجاء حديث القرآن الكريم عن الإسراء في سورة الإسراء وعن المعراج في سورة النجم قال الله تعالى: {سُبْحَانَ الَّذِي أَسْرَى بِعَبْدِهِ لَيْلاً مِنَ الْمَسْجِدِ الْحَرَامِ إِلَى الْمَسْجِدِ الْأَقْصَى الَّذِي بَارَكْنَا حَوْلَهُ لِنُرِيَهُ مِنْ آيَاتِنَا إِنَّهُ هُوَ السَّمِيعُ الْبَصِيرُ} الإسراء:1 وقال تعالى: {أَفَتُمَارُونَهُ عَلَى مَا يَرَى * وَلَقَدْ رَآهُ نَزْلَةً أُخْرَى * عِنْدَ سِدْرَةِ الْمُنْتَهَى * عِنْدَهَا جَنَّةُ الْمَأْوَى * إِذْ يَغْشَى السِّدْرَةَ مَا يَغْشَى * مَا زَاغَ الْبَصَرُ وَمَا طَغَى * لَقَدْ رَأَى مِنْ آيَاتِ رَبِّهِ الْكُبْرَى} النجم:12-18 `,
            isTrue: "ليلة الإسراء والمعراج",
          },
          {
            question: " ما هو شرف المؤمن؟ ",
            questions: [" صلاة الفروض الخمسه ", " قيام الليل "],
            message: ` الحمد لله والصلاة والسلام على رسول الله وعلى آله وصحبه, فإن الصلوات المفروضة يستوي في أدائها جميع المسلمين، ولكن التفاوت في الرتب ونيل الشرف والدرجات العلى يكون بالتقرب إلى الله تعالى بكثرة النوافل وأعمال الخير، ولذلك كان قيام الليل شرفا للمؤمن، وقد قال صلى الله عليه وسلم: واعلم أنك لن تسجد لله سجدة إلا رفع الله لك بها درجة وحط عنك بها خطيئة. الحديث رواه الإمام أحمد وغيره، وصححه الأرناؤوط وحديث: شرف المؤمن قيامه الليل، رواه الحاكم في المستدرك عن سهل بن سعد ـ رضي الله عنه ـ قال: جاء جبريل عليه السلام إلى النبي صلى الله عليه وسلم، فقال يا محمد عش ما شئت، فإنك ميت، وأحبب من أحببت فإنك مفارقه، واعمل ما شئت، فإنك مجزي به، ثم قال يا محمد: شرف المؤمن قيام الليل، وعزه استغناؤه عن الناس قال الذهبي في التلخيص: صحيح والله أعلم`,
            isTrue: " قيام الليل ",
          },
          {
            question: "ما هو عقاب السارق الذي لم يبلغ؟ ",
            questions: [" عليه الحد وهو قطع اليد ", " التوبة وارجاع الحق لمن سُرق منه "],
            message: `الحمد لله والصلاة والسلام على رسول الله وعلى آله وصحبه وفي الصحيحين أن النبي- صلى الله عليه وسلم- قال: لعن الله السارق يسرق البيضة فتقطع يده ويسرق الحبل فتقطع يده وفيهما أنه صلى الله عليه وسلم قال: [لا يزني الزاني حين يزني وهو مؤمن ولا يشرب الخمر حين يشربها وهو مؤمن ولا يسرق السارق حين يسرق وهو مؤمن ] فإن كان السارق دون البلوغ فلا يقطع ويرفع عنه الإثم لعدم التكليف ولكن لا يعفيه ذلك من إرجاع الحق إلى أصحابه لأن الشرع رفع عنه الإثم ولم يرفع عنه ضمان ما أتلف أو غصب أو سرق`,
            isTrue: " التوبة وارجاع الحق لمن سُرق منه ",
          },
          {
            question: "ما هو اسم الجبل الذي استقرت عليه سفينة نوح؟",
            questions: ["جبل الجودي", "جبل الطور"],
            message: ` فإن الجبل الذي كانت قد رست عليه في نهاية غرق الطوفان فاسمه "الجودي" نص على ذلك الله جل وعلا في قوله: وَقِيلَ يَا أَرْضُ ابْلَعِي مَاءَكِ وَيَا سَمَاءُ أَقْلِعِي وَغِيضَ الْمَاءُ وَقُضِيَ الْأَمْرُ وَاسْتَوَتْ عَلَى الْجُودِيِّ وَقِيلَ بُعْدًا لِلْقَوْمِ الظَّالِمِينَ {هود:44}، وهو الآن في منطقة تابعة لتركيا، ومتاخمة لحدود الأراضي السورية والعراقية والله أعلم`,
            isTrue: "جبل الجودي",
          },
          {
            question: " ما هو النفاق وكيفية الوقاية منه؟ ",
            questions: [" هو قول الخير في العلن وفعل الشر في السر، والتخلص منه يكون بالبعد عن الناس والانطواء",
               " هو إظهار الإيمان وإبطان الكفر والتخلص منه هو الأفتراب من الله والالتجاء إليه"
              ],
            message: ` الحمد لله والصلاة والسلام على رسول الله وعلى آله وصحبه فإن النفاق: هو فعل المنافق، وهو في الشرع إظهار الإيمان وإبطان الكفر وهو على نوعين: نفاق أكبر مخرج من الملة، وهو ما تعلق بالقلب فصاحبه يظهر الإيمان ويبطن الكفر، والنوع الثاني: النفاق الأصغر وهو ما تعلق بالعمل والجوارح ويسمى النفاق العملي، وهو الذي قال عنه النبي صلى الله عليه وسلم: أربع من كن فيه كان منافقاً خالصاً ومن كانت فيه خصلة منهن كانت فيه خصلة من النفاق حتى يدعها إذا اؤتمن خان، وإذا حدث كذب وإذا عاهد غدر وإذا خاصم فجر متفق عليه وبداية النفاق الكذب والخيانة وإخلاف الوعد والغفلة عن الله تعالى وعدم الخوف منه فأول دواء هو الالتجاء إلى الله ودعاؤه وصدق اللجوء إليه بأن يصرف عنك هذا الداء العضال (النفاق). كما أن من أسباب التخلص منه معرفة ما أعد الله عز وجل للمنافقين من العذاب الأليم والنكال العظيم نسأل الله العافية وكذلك صحبة الأصدقاء المستقمين على طاعة الله عز وجل`,
            isTrue: " هو إظهار الإيمان وإبطان الكفر والتخلص منه هو الأفتراب من الله والالتجاء إليه",
          },
    ]
}
  
  
  




// console.log(nowQuestions);

// let keys = Object.values(currQuestions);
// let nowQuestions = keys[Math.floor(Math.random() * keys.length)];


let keys = Object.values(currQuestions);
let index = parseInt(localStorage.getItem("questionIndex")) || 0;

if (index >= keys.length) {
  index = 0;
}
let nowQuestions = keys[index];

localStorage.setItem("questionIndex", index + 1);
console.log(nowQuestions);









let currentIndex = 0;
let currentWiner = 0;
const currentQuestion = nowQuestions[currentIndex].question;
const questionDom = document.querySelector(".title-question span")
const questionDomIcon = document.querySelector(".title-question i")
questionDom.textContent = currentQuestion;
const nextQuestion  = document.querySelector(".next-question");

nextQuestion.disabled = true;
nextQuestion.classList.add("add-opacity")

const countQuestions = document.querySelector(".length");

countQuestions.textContent = `${currentIndex + 1 }/${nowQuestions.length}`;



const isTrueIcon = "fa-solid fa-check is-true"
const isFalseIcon = "fa-solid fa-x is-false"


function createQuestions() {
    let ulDom = document.createElement("ul");

    nowQuestions[currentIndex].questions.forEach((ele) => {
        if (ele !== undefined && ele.trim() !== "") {

            let liDom = document.createElement("li");
            liDom.classList.add("li-questions");


            let liDomText = document.createTextNode(ele);
            liDom.appendChild(liDomText);


            let icon = document.createElement("i");
            let element = ele.trim();
            if (element === nowQuestions[currentIndex].isTrue.trim()) {
                icon.classList.add("fa-solid", "fa-check", "is-true");
            } else {
                icon.classList.add("fa-solid", "fa-x", "is-false");
            }


            icon.style.opacity = 0;
            icon.style.transition = "0.3s";


            liDom.appendChild(icon);


            ulDom.appendChild(liDom);

            checkWin(liDom, icon);
        }
    });


    contentQuestions.appendChild(ulDom);
}


createQuestions();



// Element Message Question
let elementMesg = document.createElement("p");
elementMesg.classList.add("message-question");





let countWin = document.querySelector(".count-win p");
countWin.textContent = currentWiner;
function checkWin(ele, icon){
    ele.addEventListener("click", () => {
      const span = document.createElement("span")
      span.textContent = " الأجابة الصحيحة "
      let message = document.createTextNode(nowQuestions[currentIndex].message);
        elementMesg.appendChild(span)
        elementMesg.appendChild(message);
        if (ele.textContent.trim() === nowQuestions[currentIndex].isTrue.trim()){
            currentWiner++;
            countWin.textContent = currentWiner;
            // ele.style.backgroundColor = "#c8d7e3d1";
            ele.classList.add("ture-bg");
        } else{
            // ele.style.backgroundColor = "#ebd2d2d1";
            ele.classList.add("false-bg")
            console.log(false)
            contentQuestions.appendChild(elementMesg);
        }


        
        addAndRemoveClassPointer("add")
        icon.style.opacity = "1";
            nextQuestion.classList.remove("add-opacity");
            nextQuestion.disabled = false;
        nextQuestion.addEventListener("click", handleNextQuestion);
    })
}

function addDisabled (char){
    char === "add" ? (nextQuestion.disabled = true, nextQuestion.classList.add("add-opacity"))
    :
    (nextQuestion.disabled = false, nextQuestion.classList.remove("add-opacity"))
}

// function win animation 
function showConfetti() {
  confetti({
    particleCount: 250,
    spread: 100,
    origin: { y: 0.5},
  });
}
const soundWin = document.getElementById("sound-wind");
function handleNextQuestion() {
    if (currentIndex + 1 < nowQuestions.length) {
        currentIndex++;
        elementMesg.innerHTML = "";
        elementMesg.remove();
        countQuestions.textContent = `${currentIndex + 1}/${nowQuestions.length}`;
        addAndRemoveClassPointer("remove");
        addDisabled("add")
        questionDom.textContent = nowQuestions[currentIndex].question;

        Array.from(document.querySelectorAll(".li-questions")).forEach((ele, index) => {
            let nextContent = nowQuestions[currentIndex].questions[index];
            let currIcon = ele.querySelector("i");
            ele.style.backgroundColor = "#3a4853";
            ele.innerHTML = "";
            ele.classList.remove("ture-bg");
            ele.classList.remove("false-bg");
            ele.appendChild(document.createTextNode(nextContent));

            console.log(ele);
            
            if (currIcon) {
                currIcon.className = "";
                ele.appendChild(currIcon);
            }
            checkTrueOrFalse();
        });
        soundWin.pause();
    } else {
      soundWin.play();
      showConfetti()
      nextQuestion.disabled = true;
      nextQuestion.classList.add("add-opacity");
      questionDom.textContent = " أحسنت لقد انهيت اللعبة ";
      questionDomIcon.style.opacity = "0";
      document.querySelectorAll(".li-questions").forEach((e) => {
          e.style.opacity = "0";
      })
      elementMesg.remove();
    }
}

function checkTrueOrFalse (){
    const Questions = Array.from(document.querySelectorAll(".li-questions"));
    Questions.forEach((li) => {
        const iTag = li.querySelector("i");
        li.addEventListener("click", () => {
                if (li.textContent.trim() === nowQuestions[currentIndex].isTrue.trim()){
                    iTag.style.opacity = "1"
                    iTag.classList.add("fa-solid", "fa-check", "is-true");
                } else{
                    iTag.classList.add("fa-solid", "fa-x", "is-false");
                }
        })
    })
}

function addAndRemoveClassPointer(char){
    const liList  = document.querySelectorAll(".li-questions");
    liList.forEach((current) => {
        if (char === "add"){
            current.classList.add("pointer-none");
        } else if (char === "remove"){
            current.classList.remove("pointer-none");
        } else{
            current.classList.toggle("pointer-none");
        }
    })

}